Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_hsem.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H743_hsem.
; ===============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32H743_hsem equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// HSEM address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    R0;
    volatile    uint32_t    R1;
    volatile    uint32_t    R2;
    volatile    uint32_t    R3;
    volatile    uint32_t    R4;
    volatile    uint32_t    R5;
    volatile    uint32_t    R6;
    volatile    uint32_t    R7;
    volatile    uint32_t    R8;
    volatile    uint32_t    R9;
    volatile    uint32_t    R10;
    volatile    uint32_t    R11;
    volatile    uint32_t    R12;
    volatile    uint32_t    R13;
    volatile    uint32_t    R14;
    volatile    uint32_t    R15;
    volatile    uint32_t    R16;
    volatile    uint32_t    R17;
    volatile    uint32_t    R18;
    volatile    uint32_t    R19;
    volatile    uint32_t    R20;
    volatile    uint32_t    R21;
    volatile    uint32_t    R22;
    volatile    uint32_t    R23;
    volatile    uint32_t    R24;
    volatile    uint32_t    R25;
    volatile    uint32_t    R26;
    volatile    uint32_t    R27;
    volatile    uint32_t    R28;
    volatile    uint32_t    R29;
    volatile    uint32_t    R30;
    volatile    uint32_t    R31;
    volatile    uint32_t    RLR0;
    volatile    uint32_t    RLR1;
    volatile    uint32_t    RLR2;
    volatile    uint32_t    RLR3;
    volatile    uint32_t    RLR4;
    volatile    uint32_t    RLR5;
    volatile    uint32_t    RLR6;
    volatile    uint32_t    RLR7;
    volatile    uint32_t    RLR8;
    volatile    uint32_t    RLR9;
    volatile    uint32_t    RLR10;
    volatile    uint32_t    RLR11;
    volatile    uint32_t    RLR12;
    volatile    uint32_t    RLR13;
    volatile    uint32_t    RLR14;
    volatile    uint32_t    RLR15;
    volatile    uint32_t    RLR16;
    volatile    uint32_t    RLR17;
    volatile    uint32_t    RLR18;
    volatile    uint32_t    RLR19;
    volatile    uint32_t    RLR20;
    volatile    uint32_t    RLR21;
    volatile    uint32_t    RLR22;
    volatile    uint32_t    RLR23;
    volatile    uint32_t    RLR24;
    volatile    uint32_t    RLR25;
    volatile    uint32_t    RLR26;
    volatile    uint32_t    RLR27;
    volatile    uint32_t    RLR28;
    volatile    uint32_t    RLR29;
    volatile    uint32_t    RLR30;
    volatile    uint32_t    RLR31;
    volatile    uint32_t    IER;
    volatile    uint32_t    ICR;
    volatile    uint32_t    ISR;
    volatile    uint32_t    MISR;
    volatile    uint32_t    RESERVED0[12];
    volatile    uint32_t    CR;
    volatile    uint32_t    KEYR;
} HSEM_TypeDef;

#ifdef __cplusplus
#define HSEM    reinterpret_cast<HSEM_TypeDef *>(0x58026400u)

#else
#define HSEM    ((HSEM_TypeDef *)0x58026400u)
#endif

// R0 Configuration

#define HSEM_R0_LOCK            (0x1u<<31)
#define HSEM_R0_MASTERID        (0xFFu<<8)
#define HSEM_R0_MASTERID_0      (0x1u<<8)
#define HSEM_R0_PROCID          (0xFFu<<0)
#define HSEM_R0_PROCID_0        (0x1u<<0)

// R1 Configuration

#define HSEM_R1_LOCK            (0x1u<<31)
#define HSEM_R1_MASTERID        (0xFFu<<8)
#define HSEM_R1_MASTERID_0      (0x1u<<8)
#define HSEM_R1_PROCID          (0xFFu<<0)
#define HSEM_R1_PROCID_0        (0x1u<<0)

// R2 Configuration

#define HSEM_R2_LOCK            (0x1u<<31)
#define HSEM_R2_MASTERID        (0xFFu<<8)
#define HSEM_R2_MASTERID_0      (0x1u<<8)
#define HSEM_R2_PROCID          (0xFFu<<0)
#define HSEM_R2_PROCID_0        (0x1u<<0)

// R3 Configuration

#define HSEM_R3_LOCK            (0x1u<<31)
#define HSEM_R3_MASTERID        (0xFFu<<8)
#define HSEM_R3_MASTERID_0      (0x1u<<8)
#define HSEM_R3_PROCID          (0xFFu<<0)
#define HSEM_R3_PROCID_0        (0x1u<<0)

// R4 Configuration

#define HSEM_R4_LOCK            (0x1u<<31)
#define HSEM_R4_MASTERID        (0xFFu<<8)
#define HSEM_R4_MASTERID_0      (0x1u<<8)
#define HSEM_R4_PROCID          (0xFFu<<0)
#define HSEM_R4_PROCID_0        (0x1u<<0)

// R5 Configuration

#define HSEM_R5_LOCK            (0x1u<<31)
#define HSEM_R5_MASTERID        (0xFFu<<8)
#define HSEM_R5_MASTERID_0      (0x1u<<8)
#define HSEM_R5_PROCID          (0xFFu<<0)
#define HSEM_R5_PROCID_0        (0x1u<<0)

// R6 Configuration

