Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_hsem.h
#define HSEM_R6_LOCK            (0x1u<<31)
#define HSEM_R6_MASTERID        (0xFFu<<8)
#define HSEM_R6_MASTERID_0      (0x1u<<8)
#define HSEM_R6_PROCID          (0xFFu<<0)
#define HSEM_R6_PROCID_0        (0x1u<<0)

// R7 Configuration

#define HSEM_R7_LOCK            (0x1u<<31)
#define HSEM_R7_MASTERID        (0xFFu<<8)
#define HSEM_R7_MASTERID_0      (0x1u<<8)
#define HSEM_R7_PROCID          (0xFFu<<0)
#define HSEM_R7_PROCID_0        (0x1u<<0)

// R8 Configuration

#define HSEM_R8_LOCK            (0x1u<<31)
#define HSEM_R8_MASTERID        (0xFFu<<8)
#define HSEM_R8_MASTERID_0      (0x1u<<8)
#define HSEM_R8_PROCID          (0xFFu<<0)
#define HSEM_R8_PROCID_0        (0x1u<<0)

// R9 Configuration

#define HSEM_R9_LOCK            (0x1u<<31)
#define HSEM_R9_MASTERID        (0xFFu<<8)
#define HSEM_R9_MASTERID_0      (0x1u<<8)
#define HSEM_R9_PROCID          (0xFFu<<0)
#define HSEM_R9_PROCID_0        (0x1u<<0)

// R10 Configuration

#define HSEM_R10_LOCK           (0x1u<<31)
#define HSEM_R10_MASTERID       (0xFFu<<8)
#define HSEM_R10_MASTERID_0     (0x1u<<8)
#define HSEM_R10_PROCID         (0xFFu<<0)
#define HSEM_R10_PROCID_0       (0x1u<<0)

// R11 Configuration

#define HSEM_R11_LOCK           (0x1u<<31)
#define HSEM_R11_MASTERID       (0xFFu<<8)
#define HSEM_R11_MASTERID_0     (0x1u<<8)
#define HSEM_R11_PROCID         (0xFFu<<0)
#define HSEM_R11_PROCID_0       (0x1u<<0)

// R12 Configuration

#define HSEM_R12_LOCK           (0x1u<<31)
#define HSEM_R12_MASTERID       (0xFFu<<8)
#define HSEM_R12_MASTERID_0     (0x1u<<8)
#define HSEM_R12_PROCID         (0xFFu<<0)
#define HSEM_R12_PROCID_0       (0x1u<<0)

// R13 Configuration

#define HSEM_R13_LOCK           (0x1u<<31)
#define HSEM_R13_MASTERID       (0xFFu<<8)
#define HSEM_R13_MASTERID_0     (0x1u<<8)
#define HSEM_R13_PROCID         (0xFFu<<0)
#define HSEM_R13_PROCID_0       (0x1u<<0)

// R14 Configuration

#define HSEM_R14_LOCK           (0x1u<<31)
#define HSEM_R14_MASTERID       (0xFFu<<8)
#define HSEM_R14_MASTERID_0     (0x1u<<8)
#define HSEM_R14_PROCID         (0xFFu<<0)
#define HSEM_R14_PROCID_0       (0x1u<<0)

// R15 Configuration

#define HSEM_R15_LOCK           (0x1u<<31)
#define HSEM_R15_MASTERID       (0xFFu<<8)
#define HSEM_R15_MASTERID_0     (0x1u<<8)
#define HSEM_R15_PROCID         (0xFFu<<0)
#define HSEM_R15_PROCID_0       (0x1u<<0)

// R16 Configuration

#define HSEM_R16_LOCK           (0x1u<<31)
#define HSEM_R16_MASTERID       (0xFFu<<8)
#define HSEM_R16_MASTERID_0     (0x1u<<8)
#define HSEM_R16_PROCID         (0xFFu<<0)
#define HSEM_R16_PROCID_0       (0x1u<<0)

// R17 Configuration

#define HSEM_R17_LOCK           (0x1u<<31)
#define HSEM_R17_MASTERID       (0xFFu<<8)
#define HSEM_R17_MASTERID_0     (0x1u<<8)
#define HSEM_R17_PROCID         (0xFFu<<0)
#define HSEM_R17_PROCID_0       (0x1u<<0)

// R18 Configuration

#define HSEM_R18_LOCK           (0x1u<<31)
#define HSEM_R18_MASTERID       (0xFFu<<8)
#define HSEM_R18_MASTERID_0     (0x1u<<8)
#define HSEM_R18_PROCID         (0xFFu<<0)
#define HSEM_R18_PROCID_0       (0x1u<<0)

// R19 Configuration

#define HSEM_R19_LOCK           (0x1u<<31)
#define HSEM_R19_MASTERID       (0xFFu<<8)
#define HSEM_R19_MASTERID_0     (0x1u<<8)
#define HSEM_R19_PROCID         (0xFFu<<0)
#define HSEM_R19_PROCID_0       (0x1u<<0)

// R20 Configuration

#define HSEM_R20_LOCK           (0x1u<<31)
#define HSEM_R20_MASTERID       (0xFFu<<8)
#define HSEM_R20_MASTERID_0     (0x1u<<8)
#define HSEM_R20_PROCID         (0xFFu<<0)
#define HSEM_R20_PROCID_0       (0x1u<<0)

// R21 Configuration

#define HSEM_R21_LOCK           (0x1u<<31)
#define HSEM_R21_MASTERID       (0xFFu<<8)
#define HSEM_R21_MASTERID_0     (0x1u<<8)
#define HSEM_R21_PROCID         (0xFFu<<0)
#define HSEM_R21_PROCID_0       (0x1u<<0)

// R22 Configuration

#define HSEM_R22_LOCK           (0x1u<<31)
#define HSEM_R22_MASTERID       (0xFFu<<8)
#define HSEM_R22_MASTERID_0     (0x1u<<8)
#define HSEM_R22_PROCID         (0xFFu<<0)
#define HSEM_R22_PROCID_0       (0x1u<<0)

// R23 Configuration

#define HSEM_R23_LOCK           (0x1u<<31)
#define HSEM_R23_MASTERID       (0xFFu<<8)
#define HSEM_R23_MASTERID_0     (0x1u<<8)
#define HSEM_R23_PROCID         (0xFFu<<0)
#define HSEM_R23_PROCID_0       (0x1u<<0)

// R24 Configuration

#define HSEM_R24_LOCK           (0x1u<<31)
#define HSEM_R24_MASTERID       (0xFFu<<8)
#define HSEM_R24_MASTERID_0     (0x1u<<8)
#define HSEM_R24_PROCID         (0xFFu<<0)
#define HSEM_R24_PROCID_0       (0x1u<<0)

// R25 Configuration

#define HSEM_R25_LOCK           (0x1u<<31)
#define HSEM_R25_MASTERID       (0xFFu<<8)
#define HSEM_R25_MASTERID_0     (0x1u<<8)
#define HSEM_R25_PROCID         (0xFFu<<0)
#define HSEM_R25_PROCID_0       (0x1u<<0)

// R26 Configuration

#define HSEM_R26_LOCK           (0x1u<<31)
#define HSEM_R26_MASTERID       (0xFFu<<8)
#define HSEM_R26_MASTERID_0     (0x1u<<8)
#define HSEM_R26_PROCID         (0xFFu<<0)
#define HSEM_R26_PROCID_0       (0x1u<<0)

// R27 Configuration

#define HSEM_R27_LOCK           (0x1u<<31)
#define HSEM_R27_MASTERID       (0xFFu<<8)
#define HSEM_R27_MASTERID_0     (0x1u<<8)
#define HSEM_R27_PROCID         (0xFFu<<0)
#define HSEM_R27_PROCID_0       (0x1u<<0)

// R28 Configuration

#define HSEM_R28_LOCK           (0x1u<<31)
#define HSEM_R28_MASTERID       (0xFFu<<8)
#define HSEM_R28_MASTERID_0     (0x1u<<8)
#define HSEM_R28_PROCID         (0xFFu<<0)
#define HSEM_R28_PROCID_0       (0x1u<<0)

// R29 Configuration

#define HSEM_R29_LOCK           (0x1u<<31)
#define HSEM_R29_MASTERID       (0xFFu<<8)
#define HSEM_R29_MASTERID_0     (0x1u<<8)
#define HSEM_R29_PROCID         (0xFFu<<0)
#define HSEM_R29_PROCID_0       (0x1u<<0)

// R30 Configuration

#define HSEM_R30_LOCK           (0x1u<<31)
#define HSEM_R30_MASTERID       (0xFFu<<8)
#define HSEM_R30_MASTERID_0     (0x1u<<8)
#define HSEM_R30_PROCID         (0xFFu<<0)
#define HSEM_R30_PROCID_0       (0x1u<<0)

// R31 Configuration

#define HSEM_R31_LOCK           (0x1u<<31)
#define HSEM_R31_MASTERID       (0xFFu<<8)
#define HSEM_R31_MASTERID_0     (0x1u<<8)
#define HSEM_R31_PROCID         (0xFFu<<0)
#define HSEM_R31_PROCID_0       (0x1u<<0)

// RLR0 Configuration

