Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_hsem.h
#define HSEM_RLR0_LOCK          (0x1u<<31)
#define HSEM_RLR0_MASTERID      (0xFFu<<8)
#define HSEM_RLR0_MASTERID_0    (0x1u<<8)
#define HSEM_RLR0_PROCID        (0xFFu<<0)
#define HSEM_RLR0_PROCID_0      (0x1u<<0)

// RLR1 Configuration

#define HSEM_RLR1_LOCK          (0x1u<<31)
#define HSEM_RLR1_MASTERID      (0xFFu<<8)
#define HSEM_RLR1_MASTERID_0    (0x1u<<8)
#define HSEM_RLR1_PROCID        (0xFFu<<0)
#define HSEM_RLR1_PROCID_0      (0x1u<<0)

// RLR2 Configuration

#define HSEM_RLR2_LOCK          (0x1u<<31)
#define HSEM_RLR2_MASTERID      (0xFFu<<8)
#define HSEM_RLR2_MASTERID_0    (0x1u<<8)
#define HSEM_RLR2_PROCID        (0xFFu<<0)
#define HSEM_RLR2_PROCID_0      (0x1u<<0)

// RLR3 Configuration

#define HSEM_RLR3_LOCK          (0x1u<<31)
#define HSEM_RLR3_MASTERID      (0xFFu<<8)
#define HSEM_RLR3_MASTERID_0    (0x1u<<8)
#define HSEM_RLR3_PROCID        (0xFFu<<0)
#define HSEM_RLR3_PROCID_0      (0x1u<<0)

// RLR4 Configuration

#define HSEM_RLR4_LOCK          (0x1u<<31)
#define HSEM_RLR4_MASTERID      (0xFFu<<8)
#define HSEM_RLR4_MASTERID_0    (0x1u<<8)
#define HSEM_RLR4_PROCID        (0xFFu<<0)
#define HSEM_RLR4_PROCID_0      (0x1u<<0)

// RLR5 Configuration

#define HSEM_RLR5_LOCK          (0x1u<<31)
#define HSEM_RLR5_MASTERID      (0xFFu<<8)
#define HSEM_RLR5_MASTERID_0    (0x1u<<8)
#define HSEM_RLR5_PROCID        (0xFFu<<0)
#define HSEM_RLR5_PROCID_0      (0x1u<<0)

// RLR6 Configuration

#define HSEM_RLR6_LOCK          (0x1u<<31)
#define HSEM_RLR6_MASTERID      (0xFFu<<8)
#define HSEM_RLR6_MASTERID_0    (0x1u<<8)
#define HSEM_RLR6_PROCID        (0xFFu<<0)
#define HSEM_RLR6_PROCID_0      (0x1u<<0)

// RLR7 Configuration

#define HSEM_RLR7_LOCK          (0x1u<<31)
#define HSEM_RLR7_MASTERID      (0xFFu<<8)
#define HSEM_RLR7_MASTERID_0    (0x1u<<8)
#define HSEM_RLR7_PROCID        (0xFFu<<0)
#define HSEM_RLR7_PROCID_0      (0x1u<<0)

// RLR8 Configuration

#define HSEM_RLR8_LOCK          (0x1u<<31)
#define HSEM_RLR8_MASTERID      (0xFFu<<8)
#define HSEM_RLR8_MASTERID_0    (0x1u<<8)
#define HSEM_RLR8_PROCID        (0xFFu<<0)
#define HSEM_RLR8_PROCID_0      (0x1u<<0)

// RLR9 Configuration

#define HSEM_RLR9_LOCK          (0x1u<<31)
#define HSEM_RLR9_MASTERID      (0xFFu<<8)
#define HSEM_RLR9_MASTERID_0    (0x1u<<8)
#define HSEM_RLR9_PROCID        (0xFFu<<0)
#define HSEM_RLR9_PROCID_0      (0x1u<<0)

// RLR10 Configuration

#define HSEM_RLR10_LOCK         (0x1u<<31)
#define HSEM_RLR10_MASTERID     (0xFFu<<8)
#define HSEM_RLR10_MASTERID_0   (0x1u<<8)
#define HSEM_RLR10_PROCID       (0xFFu<<0)
#define HSEM_RLR10_PROCID_0     (0x1u<<0)

// RLR11 Configuration

#define HSEM_RLR11_LOCK         (0x1u<<31)
#define HSEM_RLR11_MASTERID     (0xFFu<<8)
#define HSEM_RLR11_MASTERID_0   (0x1u<<8)
#define HSEM_RLR11_PROCID       (0xFFu<<0)
#define HSEM_RLR11_PROCID_0     (0x1u<<0)

// RLR12 Configuration

#define HSEM_RLR12_LOCK         (0x1u<<31)
#define HSEM_RLR12_MASTERID     (0xFFu<<8)
#define HSEM_RLR12_MASTERID_0   (0x1u<<8)
#define HSEM_RLR12_PROCID       (0xFFu<<0)
#define HSEM_RLR12_PROCID_0     (0x1u<<0)

// RLR13 Configuration

#define HSEM_RLR13_LOCK         (0x1u<<31)
#define HSEM_RLR13_MASTERID     (0xFFu<<8)
#define HSEM_RLR13_MASTERID_0   (0x1u<<8)
#define HSEM_RLR13_PROCID       (0xFFu<<0)
#define HSEM_RLR13_PROCID_0     (0x1u<<0)

// RLR14 Configuration

#define HSEM_RLR14_LOCK         (0x1u<<31)
#define HSEM_RLR14_MASTERID     (0xFFu<<8)
#define HSEM_RLR14_MASTERID_0   (0x1u<<8)
#define HSEM_RLR14_PROCID       (0xFFu<<0)
#define HSEM_RLR14_PROCID_0     (0x1u<<0)

// RLR15 Configuration

#define HSEM_RLR15_LOCK         (0x1u<<31)
#define HSEM_RLR15_MASTERID     (0xFFu<<8)
#define HSEM_RLR15_MASTERID_0   (0x1u<<8)
#define HSEM_RLR15_PROCID       (0xFFu<<0)
#define HSEM_RLR15_PROCID_0     (0x1u<<0)

// RLR16 Configuration

#define HSEM_RLR16_LOCK         (0x1u<<31)
#define HSEM_RLR16_MASTERID     (0xFFu<<8)
#define HSEM_RLR16_MASTERID_0   (0x1u<<8)
#define HSEM_RLR16_PROCID       (0xFFu<<0)
#define HSEM_RLR16_PROCID_0     (0x1u<<0)

// RLR17 Configuration

#define HSEM_RLR17_LOCK         (0x1u<<31)
#define HSEM_RLR17_MASTERID     (0xFFu<<8)
#define HSEM_RLR17_MASTERID_0   (0x1u<<8)
#define HSEM_RLR17_PROCID       (0xFFu<<0)
#define HSEM_RLR17_PROCID_0     (0x1u<<0)

// RLR18 Configuration

#define HSEM_RLR18_LOCK         (0x1u<<31)
#define HSEM_RLR18_MASTERID     (0xFFu<<8)
#define HSEM_RLR18_MASTERID_0   (0x1u<<8)
#define HSEM_RLR18_PROCID       (0xFFu<<0)
#define HSEM_RLR18_PROCID_0     (0x1u<<0)

// RLR19 Configuration

#define HSEM_RLR19_LOCK         (0x1u<<31)
#define HSEM_RLR19_MASTERID     (0xFFu<<8)
#define HSEM_RLR19_MASTERID_0   (0x1u<<8)
#define HSEM_RLR19_PROCID       (0xFFu<<0)
#define HSEM_RLR19_PROCID_0     (0x1u<<0)

// RLR20 Configuration

#define HSEM_RLR20_LOCK         (0x1u<<31)
#define HSEM_RLR20_MASTERID     (0xFFu<<8)
#define HSEM_RLR20_MASTERID_0   (0x1u<<8)
#define HSEM_RLR20_PROCID       (0xFFu<<0)
#define HSEM_RLR20_PROCID_0     (0x1u<<0)

// RLR21 Configuration

#define HSEM_RLR21_LOCK         (0x1u<<31)
#define HSEM_RLR21_MASTERID     (0xFFu<<8)
#define HSEM_RLR21_MASTERID_0   (0x1u<<8)
#define HSEM_RLR21_PROCID       (0xFFu<<0)
#define HSEM_RLR21_PROCID_0     (0x1u<<0)

// RLR22 Configuration

#define HSEM_RLR22_LOCK         (0x1u<<31)
#define HSEM_RLR22_MASTERID     (0xFFu<<8)
#define HSEM_RLR22_MASTERID_0   (0x1u<<8)
#define HSEM_RLR22_PROCID       (0xFFu<<0)
#define HSEM_RLR22_PROCID_0     (0x1u<<0)

// RLR23 Configuration

#define HSEM_RLR23_LOCK         (0x1u<<31)
#define HSEM_RLR23_MASTERID     (0xFFu<<8)
#define HSEM_RLR23_MASTERID_0   (0x1u<<8)
#define HSEM_RLR23_PROCID       (0xFFu<<0)
#define HSEM_RLR23_PROCID_0     (0x1u<<0)

// RLR24 Configuration

#define HSEM_RLR24_LOCK         (0x1u<<31)
#define HSEM_RLR24_MASTERID     (0xFFu<<8)
#define HSEM_RLR24_MASTERID_0   (0x1u<<8)
#define HSEM_RLR24_PROCID       (0xFFu<<0)
#define HSEM_RLR24_PROCID_0     (0x1u<<0)

// RLR25 Configuration

#define HSEM_RLR25_LOCK         (0x1u<<31)
#define HSEM_RLR25_MASTERID     (0xFFu<<8)
#define HSEM_RLR25_MASTERID_0   (0x1u<<8)
#define HSEM_RLR25_PROCID       (0xFFu<<0)
#define HSEM_RLR25_PROCID_0     (0x1u<<0)

// RLR26 Configuration

