Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_hsem.h
#define HSEM_RLR26_LOCK         (0x1u<<31)
#define HSEM_RLR26_MASTERID     (0xFFu<<8)
#define HSEM_RLR26_MASTERID_0   (0x1u<<8)
#define HSEM_RLR26_PROCID       (0xFFu<<0)
#define HSEM_RLR26_PROCID_0     (0x1u<<0)

// RLR27 Configuration

#define HSEM_RLR27_LOCK         (0x1u<<31)
#define HSEM_RLR27_MASTERID     (0xFFu<<8)
#define HSEM_RLR27_MASTERID_0   (0x1u<<8)
#define HSEM_RLR27_PROCID       (0xFFu<<0)
#define HSEM_RLR27_PROCID_0     (0x1u<<0)

// RLR28 Configuration

#define HSEM_RLR28_LOCK         (0x1u<<31)
#define HSEM_RLR28_MASTERID     (0xFFu<<8)
#define HSEM_RLR28_MASTERID_0   (0x1u<<8)
#define HSEM_RLR28_PROCID       (0xFFu<<0)
#define HSEM_RLR28_PROCID_0     (0x1u<<0)

// RLR29 Configuration

#define HSEM_RLR29_LOCK         (0x1u<<31)
#define HSEM_RLR29_MASTERID     (0xFFu<<8)
#define HSEM_RLR29_MASTERID_0   (0x1u<<8)
#define HSEM_RLR29_PROCID       (0xFFu<<0)
#define HSEM_RLR29_PROCID_0     (0x1u<<0)

// RLR30 Configuration

#define HSEM_RLR30_LOCK         (0x1u<<31)
#define HSEM_RLR30_MASTERID     (0xFFu<<8)
#define HSEM_RLR30_MASTERID_0   (0x1u<<8)
#define HSEM_RLR30_PROCID       (0xFFu<<0)
#define HSEM_RLR30_PROCID_0     (0x1u<<0)

// RLR31 Configuration

#define HSEM_RLR31_LOCK         (0x1u<<31)
#define HSEM_RLR31_MASTERID     (0xFFu<<8)
#define HSEM_RLR31_MASTERID_0   (0x1u<<8)
#define HSEM_RLR31_PROCID       (0xFFu<<0)
#define HSEM_RLR31_PROCID_0     (0x1u<<0)

// IER Configuration

#define HSEM_IER_ISEM31         (0x1u<<31)
#define HSEM_IER_ISEM30         (0x1u<<30)
#define HSEM_IER_ISEM29         (0x1u<<29)
#define HSEM_IER_ISEM28         (0x1u<<28)
#define HSEM_IER_ISEM27         (0x1u<<27)
#define HSEM_IER_ISEM26         (0x1u<<26)
#define HSEM_IER_ISEM25         (0x1u<<25)
#define HSEM_IER_ISEM24         (0x1u<<24)
#define HSEM_IER_ISEM23         (0x1u<<23)
#define HSEM_IER_ISEM22         (0x1u<<22)
#define HSEM_IER_ISEM21         (0x1u<<21)
#define HSEM_IER_ISEM20         (0x1u<<20)
#define HSEM_IER_ISEM19         (0x1u<<19)
#define HSEM_IER_ISEM18         (0x1u<<18)
#define HSEM_IER_ISEM17         (0x1u<<17)
#define HSEM_IER_ISEM16         (0x1u<<16)
#define HSEM_IER_ISEM15         (0x1u<<15)
#define HSEM_IER_ISEM14         (0x1u<<14)
#define HSEM_IER_ISEM13         (0x1u<<13)
#define HSEM_IER_ISEM12         (0x1u<<12)
#define HSEM_IER_ISEM11         (0x1u<<11)
#define HSEM_IER_ISEM10         (0x1u<<10)
#define HSEM_IER_ISEM9          (0x1u<<9)
#define HSEM_IER_ISEM8          (0x1u<<8)
#define HSEM_IER_ISEM7          (0x1u<<7)
#define HSEM_IER_ISEM6          (0x1u<<6)
#define HSEM_IER_ISEM5          (0x1u<<5)
#define HSEM_IER_ISEM4          (0x1u<<4)
#define HSEM_IER_ISEM3          (0x1u<<3)
#define HSEM_IER_ISEM2          (0x1u<<2)
#define HSEM_IER_ISEM1          (0x1u<<1)
#define HSEM_IER_ISEM0          (0x1u<<0)

// ICR Configuration

#define HSEM_ICR_ISEM31         (0x1u<<31)
#define HSEM_ICR_ISEM30         (0x1u<<30)
#define HSEM_ICR_ISEM29         (0x1u<<29)
#define HSEM_ICR_ISEM28         (0x1u<<28)
#define HSEM_ICR_ISEM27         (0x1u<<27)
#define HSEM_ICR_ISEM26         (0x1u<<26)
#define HSEM_ICR_ISEM25         (0x1u<<25)
#define HSEM_ICR_ISEM24         (0x1u<<24)
#define HSEM_ICR_ISEM23         (0x1u<<23)
#define HSEM_ICR_ISEM22         (0x1u<<22)
#define HSEM_ICR_ISEM21         (0x1u<<21)
#define HSEM_ICR_ISEM20         (0x1u<<20)
#define HSEM_ICR_ISEM19         (0x1u<<19)
#define HSEM_ICR_ISEM18         (0x1u<<18)
#define HSEM_ICR_ISEM17         (0x1u<<17)
#define HSEM_ICR_ISEM16         (0x1u<<16)
#define HSEM_ICR_ISEM15         (0x1u<<15)
#define HSEM_ICR_ISEM14         (0x1u<<14)
#define HSEM_ICR_ISEM13         (0x1u<<13)
#define HSEM_ICR_ISEM12         (0x1u<<12)
#define HSEM_ICR_ISEM11         (0x1u<<11)
#define HSEM_ICR_ISEM10         (0x1u<<10)
#define HSEM_ICR_ISEM9          (0x1u<<9)
#define HSEM_ICR_ISEM8          (0x1u<<8)
#define HSEM_ICR_ISEM7          (0x1u<<7)
#define HSEM_ICR_ISEM6          (0x1u<<6)
#define HSEM_ICR_ISEM5          (0x1u<<5)
#define HSEM_ICR_ISEM4          (0x1u<<4)
#define HSEM_ICR_ISEM3          (0x1u<<3)
#define HSEM_ICR_ISEM2          (0x1u<<2)
#define HSEM_ICR_ISEM1          (0x1u<<1)
#define HSEM_ICR_ISEM0          (0x1u<<0)

// ISR Configuration

#define HSEM_ISR_ISEM31         (0x1u<<31)
#define HSEM_ISR_ISEM30         (0x1u<<30)
#define HSEM_ISR_ISEM29         (0x1u<<29)
#define HSEM_ISR_ISEM28         (0x1u<<28)
#define HSEM_ISR_ISEM27         (0x1u<<27)
#define HSEM_ISR_ISEM26         (0x1u<<26)
#define HSEM_ISR_ISEM25         (0x1u<<25)
#define HSEM_ISR_ISEM24         (0x1u<<24)
#define HSEM_ISR_ISEM23         (0x1u<<23)
#define HSEM_ISR_ISEM22         (0x1u<<22)
#define HSEM_ISR_ISEM21         (0x1u<<21)
#define HSEM_ISR_ISEM20         (0x1u<<20)
#define HSEM_ISR_ISEM19         (0x1u<<19)
#define HSEM_ISR_ISEM18         (0x1u<<18)
#define HSEM_ISR_ISEM17         (0x1u<<17)
#define HSEM_ISR_ISEM16         (0x1u<<16)
#define HSEM_ISR_ISEM15         (0x1u<<15)
#define HSEM_ISR_ISEM14         (0x1u<<14)
#define HSEM_ISR_ISEM13         (0x1u<<13)
#define HSEM_ISR_ISEM12         (0x1u<<12)
#define HSEM_ISR_ISEM11         (0x1u<<11)
#define HSEM_ISR_ISEM10         (0x1u<<10)
#define HSEM_ISR_ISEM9          (0x1u<<9)
#define HSEM_ISR_ISEM8          (0x1u<<8)
#define HSEM_ISR_ISEM7          (0x1u<<7)
#define HSEM_ISR_ISEM6          (0x1u<<6)
#define HSEM_ISR_ISEM5          (0x1u<<5)
#define HSEM_ISR_ISEM4          (0x1u<<4)
#define HSEM_ISR_ISEM3          (0x1u<<3)
#define HSEM_ISR_ISEM2          (0x1u<<2)
#define HSEM_ISR_ISEM1          (0x1u<<1)
#define HSEM_ISR_ISEM0          (0x1u<<0)

// MISR Configuration

#define HSEM_MISR_ISEM31        (0x1u<<31)
#define HSEM_MISR_ISEM30        (0x1u<<30)
#define HSEM_MISR_ISEM29        (0x1u<<29)
#define HSEM_MISR_ISEM28        (0x1u<<28)
#define HSEM_MISR_ISEM27        (0x1u<<27)
#define HSEM_MISR_ISEM26        (0x1u<<26)
#define HSEM_MISR_ISEM25        (0x1u<<25)
#define HSEM_MISR_ISEM24        (0x1u<<24)
#define HSEM_MISR_ISEM23        (0x1u<<23)
#define HSEM_MISR_ISEM22        (0x1u<<22)
#define HSEM_MISR_ISEM21        (0x1u<<21)
#define HSEM_MISR_ISEM20        (0x1u<<20)
#define HSEM_MISR_ISEM19        (0x1u<<19)
#define HSEM_MISR_ISEM18        (0x1u<<18)
#define HSEM_MISR_ISEM17        (0x1u<<17)
#define HSEM_MISR_ISEM16        (0x1u<<16)
#define HSEM_MISR_ISEM15        (0x1u<<15)
#define HSEM_MISR_ISEM14        (0x1u<<14)
#define HSEM_MISR_ISEM13        (0x1u<<13)
#define HSEM_MISR_ISEM12        (0x1u<<12)
#define HSEM_MISR_ISEM11        (0x1u<<11)
#define HSEM_MISR_ISEM10        (0x1u<<10)
#define HSEM_MISR_ISEM9         (0x1u<<9)
#define HSEM_MISR_ISEM8         (0x1u<<8)
#define HSEM_MISR_ISEM7         (0x1u<<7)
#define HSEM_MISR_ISEM6         (0x1u<<6)
#define HSEM_MISR_ISEM5         (0x1u<<5)
#define HSEM_MISR_ISEM4         (0x1u<<4)
#define HSEM_MISR_ISEM3         (0x1u<<3)
#define HSEM_MISR_ISEM2         (0x1u<<2)
#define HSEM_MISR_ISEM1         (0x1u<<1)
#define HSEM_MISR_ISEM0         (0x1u<<0)

// CR Configuration

#define HSEM_CR_KEY             (0xFFFFu<<16)
#define HSEM_CR_KEY_0           (0x1u<<16)
#define HSEM_CR_MASTERID        (0xFFu<<8)
#define HSEM_CR_MASTERID_0      (0x1u<<8)

// KEYR Configuration

#define HSEM_KEYR_KEY           (0xFFFFu<<16)
#define HSEM_KEYR_KEY_0         (0x1u<<16)
